app/Http/Controllers/MediaController.php

    public function createMovie (Request $request)
   {
    $model = new Media();
    $model->name = $request->name;
    $model->synopsis = $request->synopsis;
    $model->urlimg = $request->url_img;
    $model->save();
---
insert into "media" ("name", "synopsis", "urlimg", "updated_at", "created_at") values ('Iron Man', 'Tony Stark, inventeur de génie, vendeur d''armes et playboy milliardaire, est kidnappé. Forcé par ses ravisseurs de fabriquer une arme redoutable, il construit en secret une armure high-tech révolutionnaire qu''il utilise pour s''échapper. Comprenant la puissance de cette armure, il décide de l''améliorer et de l''utiliser pour faire régner la justice et protéger les innocents.', 'https://image.tmdb.org/t/p/w500/egEkFOCl87aHJLkIGXGxzNdpQV3.jpg', '2024-04-03 22:05:22', '2024-04-03 22:05:22')